import random

# Перелік істин і дій
truths = [
    "Який момент був найнезручнішим у вашому житті?",
    "Що ви ніколи не зробите, навіть якщо хтось запропонує вам усі гроші світу?",
    "Що найромантичніше робили для вас?",
    "Чого ви найбільше боїтеся?",
    "Кінець світу настане наступного тижня, і ви можете робити все, що захочете. Чим би зайнялися?",
    "Що такого ви зробили, що змусило вас по-справжньому пишатися собою?",
    "Якби у вас був свій герб, що б на ньому було зображено?",
]

dares = [
    "Викрикніть перше слово, яке спаде вам на думку просто зараз.",
    "Відкрийте будь-яку соцмережу, зайдіть в акаунт першої людини, яку побачите, і поставте лайк на кожен її пост.",
    "Відкрийте найближчу книжку на випадковій сторінці, не дивлячись, вкажіть на будь-яке речення. Надішліть її останній людині, яка написала вам.",
    "Придумайте першій людині, яка спала вам на думку, кличку, що характеризувала б її.",
    "Прорекламуйте себе.",
    "Придумайте фантастичну історію про себе і надішліть це рандомній людині.",
]


def play_truth_or_dare():
    # Виберіть випадкового гравця для початку
    players = ["Player 1", "Player 2", "Player 3"]
    current_player = random.choice(players)

    while True:
        # Попросіть поточного гравця обрати правду або дію
        choice = input(f"{current_player}, Ви обираєте правду чи дію? ")

        # Отримайте відповідь
        if choice == "правду":
            prompt = random.choice(truths)
        elif choice == "дію":
            prompt = random.choice(dares)
        else:
            print("Неправильний вибір. Перевірте ваше написання")
            continue

        # Поставте гравцеві запитання або змусьте його щось зробити
        print(f"{prompt}")

        if choice == "дія":
            # Перевірте, чи виконав гравець дію
            completed = input("Ви виконали дію? ")

            if completed == "так":
                print("Добре")
            else:
                print("Спробуй ще раз")

        # Перехід до наступного гравця
        current_player = players[(players.index(current_player) + 1) % len(players)]

        # Запитайте, чи хочуть гравці продовжувати гру
        continue_playing = input("Ви хочете продовжити гру? ")

        if continue_playing == "ні":
            break

play_truth_or_dare()
    